"""
    大模型服务平台-->百炼用户指南（模型）--> 视频生成--> 视频生成 : https://help.aliyun.com/zh/model-studio/image-expansion

    阿里云百炼提供多样化的视频模型选择，涵盖文生视频、图生视频（通用/舞蹈/唱演/播报等）、视频编辑（通用/视频风格重绘/视频口型替换）等应用场景。


    模型总览
类别

说明

类别

说明

文生视频

    文生视频：一句话生成视频，视频风格丰富，画质细腻。

图生视频

    首帧生视频：将输入图片作为视频首帧，并根据提示词生成视频。

    首尾帧生视频：只需要提供首帧和尾帧图片，便能根据提示词生成一段丝滑流畅的动态视频。

    多图生视频：支持输入一张或多张图片，参考图片中的主体或背景，并结合提示词生成视频。

图+动作模板生成视频：

    通义万相-图生动作基于人物图片和模板视频，将视频主角的动作、表情迁移到图片角色中，生成人物动作视频。

    通义万相-视频换人基于人物图片和模板视频，将视频主角替换为图片角色，保留原视频的场景、光照和色调。

    舞动人像AnimateAnyone基于人物图片和动作视频生成舞蹈视频。

图+音频生成对口型视频

    通义万相-数字人基于人物图片和音频，动作幅度大且自然，支持全身、半身、肖像等多种画幅，适合唱歌、表演等场景。

    悦动人像EMO基于人物图片和音频，口型与表情表现力强，支持肖像、半身，适合人物特写场景。

    灵动人像LivePortrait基于人物图片和音频，适合语音播报场景。

    图+表情模板生成表情包视频：表情包Emoji基于人脸图片和预设的人脸动态模板，生成人脸表情包视频。

视频编辑

    通用视频编辑：基于输入的文本提示词、图片和视频，可执行多种视频编辑任务。例如，通过提取输入视频的运动特征，并结合提示词生成新的视频。

    视频口型替换：声动人像VideoRetalk基于人物视频和音频进行视频口型替换，适合短视频制作、视频翻译等场景。

    视频风格转换：视频风格重绘可将视频转换为日式漫画、美式漫画等八种风格。




"""