"""
    大模型服务平台-->百炼用户指南（模型）--> 图像生成 --> 虚拟模特生成: https://help.aliyun.com/zh/model-studio/virtual-model-generation

    通义万相-虚拟模特模型支持在保持真人实拍模特站姿不变的前提下，对拍摄背景图、模特进行替换，快速生成更多模特拍摄图。

基本介绍
    通义万相-虚拟模特可以对上传的真人或者人台实拍商品展示图进行智能生成，将其中的模特和背景替换为心仪的内容，在保持人物姿态不变的情况下，使用虚拟模特对商品进行更加精美、多样的展示。支持各种与模特产生互动的商品，如手持小商品、服装、鞋靴、配饰等。

    如想了解功能效果或使用流程，可以在通义万相-虚拟模特(V0.7)功能中进行初步体验。

使用场景
    商品模特创意设计：电商商品设计领域，客户上传一张身着基础款连衣裙的模特照片，通过虚拟模特功能，选择维多利亚时代复古风格的虚拟模特与奢华背景，保留原有模特的优雅姿态，将连衣裙材质和色彩自动调整以匹配新场景，实现高端定制系列的视觉预览。

    珠宝饰品穿戴展示：珠宝商希望突出展示其新款项链，上传佩戴基础项链的半身人台照或者基础模特照，通过AI技术生成更为精致优美的虚拟模特，实现虚拟模特穿戴珠宝的璀璨效果，同时调整背景为高贵典雅的室内环境，提升商品档次感，增加珠宝细节纹理融合。

    模特鞋靴穿戴展示：设计师为展示新款多功能球鞋，上传穿着新款鞋靴的基础站立姿势的模特照片，利用虚拟模特技术快速更换生成新的虚拟模特，生成一系列从休闲街头风到专业运动风格背景展示图，满足不同顾客群体的场景需求，创造出多样化的时尚造型。

    童装童鞋模特生成：童装品牌需要展示儿童在多风格场景中的穿着效果，上传基础照片后，使用虚拟模特生成活泼可爱的儿童形象，更换为品牌最新童装系列，背景设置为学校、游乐场等场景，展现孩子们的天真烂漫与服装的舒适度，确保童装新品都能极速展示。

特色优势
    效果业界领先：虚拟模特生成图像语义一致性更精准，AI局部创作布局自然、细节丰富、画面细腻、结果逼真，又保持视觉效果的和谐与专业性，无需担心人工合成的痕迹。

    稳定、易用平台服务：提供在高并发、大流量下的稳定虚拟模特图片生成响应，可直接调用的简单推理API 接口，服务简单易用，易被集成，兼容性强。

    模特图高品质生成：支持人台图、真人图、服装图模特生成，支持2:1、16:9、4:3、1:1、3:4、9:16、1:2多比例图片生成，支持最大短边大小到2024，支持背景参考图输入和权重自由配置。

"""